/* * * * * * * * * * * * * * * * * * * * *
    пн. Креативність
    вт. Фінанси
    сер. Інтелект
    чт. Відношення / емоції
    пт. Здоров'я
    сб. Духовність
    нед. Звички / ритуали
* * * * * * * * * * * * * * * * * * * * * */

interface CairosElement {
    name: string;
    description: string;
    symbol?: string;
}

const cairos: {[key: number]: CairosElement} = {
    1: {
        name: "Креативність",
        description: 'Понеділок—це день для нових ідей і натхнення. Відкривайте світ можливостей і творіть.',
        symbol: 'C'
    },
    2: {
        name: "Фінанси",
        description: 'Вівторок присвячений фінансовій дисципліні та розумним рішенням. Керуйте ресурсами мудро.',
        symbol: 'A'
    },
    3: {
        name: "Інтелект",
        description: 'Середа—це час для знань і роздумів. Збагачуйте свій розум новими ідеями.',
        symbol: 'I'
    },
    4: {
        name: "Відносини",
        description: 'Четвер—день для взаємозв\'язків і емоційної глибини. Будуйте міцні зв\'язки.',
        symbol: 'R'
    },
    5: {
        name: "Здоров'я",
        description: 'П’ятниця нагадує про важливість фізичного та ментального здоров\'я. Піклуйтеся про себе.',
        symbol: 'O'
    },
    6: {
        name: "Духовність",
        description: 'Субота—час для духовного зростання і внутрішніх роздумів. Пізнавайте себе.',
        symbol: 'S'
    },
    7: {
        name: "Звички",
        description: 'Неділя—день для корисних звичок і ритуалів. Створюйте структуру і сенс у житті.'
    },
}

export default cairos;